STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/ROT/OEMiROT_Boot/Src/low_level_security.c
    if (HAL_RTCEx_SetTamper_IT(&RTCHandle, &sTamper) != HAL_OK)
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_ACT_EN, FLOW_CTRL_TAMP_ACT_EN);
#elif defined(OEMIROT_DEV_MODE)
    /* Deactivation is required when OEMIROT_TAMPER_ENABLE moved from != NO_TAMPER to == NO_TAMPER with no power off */
    HAL_RTCEx_DeactivateTamper(&RTCHandle, RTC_TAMPER_ALL);
#else
    /* Keep the user tamper configuration */
#endif  /* (OEMIROT_TAMPER_ENABLE == ALL_TAMPER) */
#if (OEMIROT_TAMPER_ENABLE != NO_TAMPER)
    /*  Internal Tamper activation  */
    /*  Enable Cryptographic IPs fault (tamp_itamp9), Backup domain voltage threshold monitoring (tamp_itamp1)*/
    if (HAL_RTCEx_SetInternalTamper_IT(&RTCHandle, (RTC_InternalTamperTypeDef *)&InternalTamperConf) != HAL_OK)
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_INT_EN, FLOW_CTRL_TAMP_INT_EN);

    /*  Set tamper configuration secure only  */
    SET_BIT(TAMP->SECCFGR, TAMP_SECURE_FULL_YES);
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_SEC_EN, FLOW_CTRL_TAMP_SEC_EN);

    /*  Set tamper configuration privileged only   */
    SET_BIT(TAMP->PRIVCFGR, TAMP_PRIVILEGE_FULL_YES);
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_PRIV_EN, FLOW_CTRL_TAMP_PRIV_EN);

    /*  Activate Secret Erase */
    DeviceSecretConf = (uint32_t)(TAMP_DEVICESECRETS_ERASE_SRAM2 | TAMP_DEVICESECRETS_ERASE_ICACHE | TAMP_DEVICESECRETS_ERASE_PKA_SRAM);
    HAL_RTCEx_ConfigEraseDeviceSecrets(&RTCHandle, DeviceSecretConf);

    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_CFG_EN, FLOW_CTRL_TAMP_CFG_EN);
    BOOT_LOG_INF("TAMPER Activated");
#elif defined(OEMIROT_DEV_MODE)
    /* Deactivation is required when OEMIROT_TAMPER_ENABLE moved from != NO_TAMPER to == NO_TAMPER with no power off */
    HAL_RTCEx_DeactivateTamper(&RTCHandle, RTC_TAMPER_ALL);
#endif /* (OEMIROT_TAMPER_ENABLE != NO_TAMPER) */
    /* disable write access to backup domain */
   (void)READ_REG(TAMP->CR1); /* Dummy read to wait for write effectiveness in tamper */
    HAL_PWR_DisableBkUpAccess();
  }
#if (OEMIROT_TAMPER_ENABLE != NO_TAMPER)
  /* verification stage */
  else
  {
#if (OEMIROT_TAMPER_ENABLE == ALL_TAMPER)
    /*  Check External Tamper activation */
    const uint32_t expected_fltcr = sTamper.Filter | sTamper.SamplingFrequency | sTamper.PrechargeDuration | sTamper.TamperPullUp;
    if (((READ_REG(TAMP->CR1) & TAMP_CR1_TAMP4E) != TAMP_CR1_TAMP4E) ||
       ((READ_REG(TAMP->FLTCR) & expected_fltcr) != expected_fltcr) ||
        (READ_BIT(TAMP->CR2, (TAMP_CR2_TAMP4POM | TAMP_CR2_TAMP4TRG)) != 0x00000000U))
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_ACT_CH, FLOW_CTRL_TAMP_ACT_CH);
#endif  /* (OEMIROT_TAMPER_ENABLE == ALL_TAMPER) */

     /*  Check Internal Tamper activation */
     if((READ_BIT(RTC->CR, RTC_CR_TAMPTS) != InternalTamperConf.TimeStampOnTamperDetection) ||
        (CHECK_REG(TAMP->CR1, (TAMP_CR1_ITAMP9E))) ||
        (CHECK_REG(TAMP->IER, (TAMP_IER_ITAMP9IE))) ||
        (READ_BIT(TAMP->CR3, (TAMP_CR3_ITAMP9POM)) != 0x00000000U))
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_INT_CH, FLOW_CTRL_TAMP_INT_CH);

    /*  Check tamper configuration secure only  */
    if (CHECK_REG(TAMP->SECCFGR, TAMP_SECURE_FULL_YES))
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_SEC_CH, FLOW_CTRL_TAMP_SEC_CH);

    /*  Check tamper configuration privileged only */
    if (CHECK_REG(TAMP->PRIVCFGR, TAMP_PRIVILEGE_FULL_YES))
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_PRIV_CH, FLOW_CTRL_TAMP_PRIV_CH);

    /*  Check Secret Erase */
    DeviceSecretConf = (uint32_t)TAMP_DEVICESECRETS_ERASE_SRAM2 | TAMP_DEVICESECRETS_ERASE_ICACHE | TAMP_DEVICESECRETS_ERASE_PKA_SRAM;

    if (READ_REG(TAMP->RPCFGR) != DeviceSecretConf)
    {
      Error_Handler();
    }
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_TAMP_CFG_CH, FLOW_CTRL_TAMP_CFG_CH);
  }
#endif /*  OEMIROT_TAMPER_ENABLE != NO_TAMPER */
}
/**
  * @}
  */
